MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAK169/mcu.h
extern volatile __DCH7CSIZbits_t DCH7CSIZbits __asm__ ("DCH7CSIZ") __attribute__((section("sfrs"), address(0xBF811630)));
extern volatile uint32_t        DCH7CSIZCLR __attribute__((section("sfrs"),address(0xBF811634)));
extern volatile uint32_t        DCH7CSIZSET __attribute__((section("sfrs"),address(0xBF811638)));
extern volatile uint32_t        DCH7CSIZINV __attribute__((section("sfrs"),address(0xBF81163C)));
#define DCH7CPTR DCH7CPTR
extern volatile uint32_t   DCH7CPTR __attribute__((section("sfrs"), address(0xBF811640)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH7CPTRbits_t;
extern volatile __DCH7CPTRbits_t DCH7CPTRbits __asm__ ("DCH7CPTR") __attribute__((section("sfrs"), address(0xBF811640)));
#define DCS7CPTR DCS7CPTR
extern volatile uint32_t   DCS7CPTR __attribute__((section("sfrs"), address(0xBF811640)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS7CPTRbits_t;
extern volatile __DCS7CPTRbits_t DCS7CPTRbits __asm__ ("DCS7CPTR") __attribute__((section("sfrs"), address(0xBF811640)));
extern volatile uint32_t        DCH7CPTRCLR __attribute__((section("sfrs"),address(0xBF811644)));
extern volatile uint32_t        DCS7CPTRCLR __attribute__((section("sfrs"),address(0xBF811644)));
extern volatile uint32_t        DCH7CPTRSET __attribute__((section("sfrs"),address(0xBF811648)));
extern volatile uint32_t        DCS7CPTRSET __attribute__((section("sfrs"),address(0xBF811648)));
extern volatile uint32_t        DCH7CPTRINV __attribute__((section("sfrs"),address(0xBF81164C)));
extern volatile uint32_t        DCS7CPTRINV __attribute__((section("sfrs"),address(0xBF81164C)));
#define DCH7DAT DCH7DAT
extern volatile uint32_t   DCH7DAT __attribute__((section("sfrs"), address(0xBF811650)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH7DATbits_t;
extern volatile __DCH7DATbits_t DCH7DATbits __asm__ ("DCH7DAT") __attribute__((section("sfrs"), address(0xBF811650)));
extern volatile uint32_t        DCH7DATCLR __attribute__((section("sfrs"),address(0xBF811654)));
extern volatile uint32_t        DCH7DATSET __attribute__((section("sfrs"),address(0xBF811658)));
extern volatile uint32_t        DCH7DATINV __attribute__((section("sfrs"),address(0xBF81165C)));
#define I2C1CON I2C1CON
extern volatile uint32_t   I2C1CON __attribute__((section("sfrs"), address(0xBF820000)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C1CONbits_t;
extern volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON") __attribute__((section("sfrs"), address(0xBF820000)));
extern volatile uint32_t        I2C1CONCLR __attribute__((section("sfrs"),address(0xBF820004)));
extern volatile uint32_t        I2C1CONSET __attribute__((section("sfrs"),address(0xBF820008)));
extern volatile uint32_t        I2C1CONINV __attribute__((section("sfrs"),address(0xBF82000C)));
#define I2C1STAT I2C1STAT
extern volatile uint32_t   I2C1STAT __attribute__((section("sfrs"), address(0xBF820010)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C1STATbits_t;
extern volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT") __attribute__((section("sfrs"), address(0xBF820010)));
extern volatile uint32_t        I2C1STATCLR __attribute__((section("sfrs"),address(0xBF820014)));
extern volatile uint32_t        I2C1STATSET __attribute__((section("sfrs"),address(0xBF820018)));
extern volatile uint32_t        I2C1STATINV __attribute__((section("sfrs"),address(0xBF82001C)));
#define I2C1ADD I2C1ADD
extern volatile uint32_t   I2C1ADD __attribute__((section("sfrs"), address(0xBF820020)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C1ADDbits_t;
extern volatile __I2C1ADDbits_t I2C1ADDbits __asm__ ("I2C1ADD") __attribute__((section("sfrs"), address(0xBF820020)));
extern volatile uint32_t        I2C1ADDCLR __attribute__((section("sfrs"),address(0xBF820024)));
extern volatile uint32_t        I2C1ADDSET __attribute__((section("sfrs"),address(0xBF820028)));
extern volatile uint32_t        I2C1ADDINV __attribute__((section("sfrs"),address(0xBF82002C)));
#define I2C1MSK I2C1MSK
extern volatile uint32_t   I2C1MSK __attribute__((section("sfrs"), address(0xBF820030)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C1MSKbits_t;
extern volatile __I2C1MSKbits_t I2C1MSKbits __asm__ ("I2C1MSK") __attribute__((section("sfrs"), address(0xBF820030)));
extern volatile uint32_t        I2C1MSKCLR __attribute__((section("sfrs"),address(0xBF820034)));
extern volatile uint32_t        I2C1MSKSET __attribute__((section("sfrs"),address(0xBF820038)));
extern volatile uint32_t        I2C1MSKINV __attribute__((section("sfrs"),address(0xBF82003C)));
#define I2C1BRG I2C1BRG
extern volatile uint32_t   I2C1BRG __attribute__((section("sfrs"), address(0xBF820040)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C1BRGbits_t;
extern volatile __I2C1BRGbits_t I2C1BRGbits __asm__ ("I2C1BRG") __attribute__((section("sfrs"), address(0xBF820040)));
extern volatile uint32_t        I2C1BRGCLR __attribute__((section("sfrs"),address(0xBF820044)));
extern volatile uint32_t        I2C1BRGSET __attribute__((section("sfrs"),address(0xBF820048)));
extern volatile uint32_t        I2C1BRGINV __attribute__((section("sfrs"),address(0xBF82004C)));
#define I2C1TRN I2C1TRN
extern volatile uint32_t   I2C1TRN __attribute__((section("sfrs"), address(0xBF820050)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C1TRNbits_t;
extern volatile __I2C1TRNbits_t I2C1TRNbits __asm__ ("I2C1TRN") __attribute__((section("sfrs"), address(0xBF820050)));
extern volatile uint32_t        I2C1TRNCLR __attribute__((section("sfrs"),address(0xBF820054)));
extern volatile uint32_t        I2C1TRNSET __attribute__((section("sfrs"),address(0xBF820058)));
extern volatile uint32_t        I2C1TRNINV __attribute__((section("sfrs"),address(0xBF82005C)));
#define I2C1RCV I2C1RCV
extern volatile uint32_t   I2C1RCV __attribute__((section("sfrs"), address(0xBF820060)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C1RCVbits_t;
extern volatile __I2C1RCVbits_t I2C1RCVbits __asm__ ("I2C1RCV") __attribute__((section("sfrs"), address(0xBF820060)));
extern volatile uint32_t        I2C1RCVCLR __attribute__((section("sfrs"),address(0xBF820064)));
extern volatile uint32_t        I2C1RCVSET __attribute__((section("sfrs"),address(0xBF820068)));
extern volatile uint32_t        I2C1RCVINV __attribute__((section("sfrs"),address(0xBF82006C)));
#define I2C2CON I2C2CON
extern volatile uint32_t   I2C2CON __attribute__((section("sfrs"), address(0xBF820200)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C2CONbits_t;
