MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAK169/mcu.h
#define _GLCDL1MODE_SRCBLEND_POSITION            0x00000008
#define _GLCDL1MODE_SRCBLEND_MASK                0x00000F00
#define _GLCDL1MODE_SRCBLEND_LENGTH              0x00000004

#define _GLCDL1MODE_DESTBLEND_POSITION           0x0000000C
#define _GLCDL1MODE_DESTBLEND_MASK               0x0000F000
#define _GLCDL1MODE_DESTBLEND_LENGTH             0x00000004

#define _GLCDL1MODE_ALPHA_POSITION               0x00000010
#define _GLCDL1MODE_ALPHA_MASK                   0x00FF0000
#define _GLCDL1MODE_ALPHA_LENGTH                 0x00000008

#define _GLCDL1MODE_MULALPHA_POSITION            0x0000001C
#define _GLCDL1MODE_MULALPHA_MASK                0x10000000
#define _GLCDL1MODE_MULALPHA_LENGTH              0x00000001

#define _GLCDL1MODE_FORCEALPHA_POSITION          0x0000001D
#define _GLCDL1MODE_FORCEALPHA_MASK              0x20000000
#define _GLCDL1MODE_FORCEALPHA_LENGTH            0x00000001

#define _GLCDL1MODE_DISABIFIL_POSITION           0x0000001E
#define _GLCDL1MODE_DISABIFIL_MASK               0x40000000
#define _GLCDL1MODE_DISABIFIL_LENGTH             0x00000001

#define _GLCDL1MODE_LAYEREN_POSITION             0x0000001F
#define _GLCDL1MODE_LAYEREN_MASK                 0x80000000
#define _GLCDL1MODE_LAYEREN_LENGTH               0x00000001

#define _GLCDL1START_STARTY_POSITION             0x00000000
#define _GLCDL1START_STARTY_MASK                 0x000007FF
#define _GLCDL1START_STARTY_LENGTH               0x0000000B

#define _GLCDL1START_STARTX_POSITION             0x00000010
#define _GLCDL1START_STARTX_MASK                 0x07FF0000
#define _GLCDL1START_STARTX_LENGTH               0x0000000B

#define _GLCDL1SIZE_SIZEY_POSITION               0x00000000
#define _GLCDL1SIZE_SIZEY_MASK                   0x000007FF
#define _GLCDL1SIZE_SIZEY_LENGTH                 0x0000000B

#define _GLCDL1SIZE_SIZEX_POSITION               0x00000010
#define _GLCDL1SIZE_SIZEX_MASK                   0x07FF0000
#define _GLCDL1SIZE_SIZEX_LENGTH                 0x0000000B

#define _GLCDL1BADDR_BASEADDR_POSITION           0x00000000
#define _GLCDL1BADDR_BASEADDR_MASK               0xFFFFFFFF
#define _GLCDL1BADDR_BASEADDR_LENGTH             0x00000020

#define _GLCDL1STRIDE_STRIDE_POSITION            0x00000000
#define _GLCDL1STRIDE_STRIDE_MASK                0x0000FFFF
#define _GLCDL1STRIDE_STRIDE_LENGTH              0x00000010

#define _GLCDL1RES_RESY_POSITION                 0x00000000
#define _GLCDL1RES_RESY_MASK                     0x000007FF
#define _GLCDL1RES_RESY_LENGTH                   0x0000000B

#define _GLCDL1RES_RESX_POSITION                 0x00000010
#define _GLCDL1RES_RESX_MASK                     0x07FF0000
#define _GLCDL1RES_RESX_LENGTH                   0x0000000B

#define _GLCDL2MODE_COLORMODE_POSITION           0x00000000
#define _GLCDL2MODE_COLORMODE_MASK               0x0000000F
#define _GLCDL2MODE_COLORMODE_LENGTH             0x00000004

#define _GLCDL2MODE_SRCBLEND_POSITION            0x00000008
#define _GLCDL2MODE_SRCBLEND_MASK                0x00000F00
#define _GLCDL2MODE_SRCBLEND_LENGTH              0x00000004

#define _GLCDL2MODE_DESTBLEND_POSITION           0x0000000C
#define _GLCDL2MODE_DESTBLEND_MASK               0x0000F000
#define _GLCDL2MODE_DESTBLEND_LENGTH             0x00000004

#define _GLCDL2MODE_ALPHA_POSITION               0x00000010
#define _GLCDL2MODE_ALPHA_MASK                   0x00FF0000
#define _GLCDL2MODE_ALPHA_LENGTH                 0x00000008

#define _GLCDL2MODE_MULALPHA_POSITION            0x0000001C
#define _GLCDL2MODE_MULALPHA_MASK                0x10000000
#define _GLCDL2MODE_MULALPHA_LENGTH              0x00000001

#define _GLCDL2MODE_FORCEALPHA_POSITION          0x0000001D
#define _GLCDL2MODE_FORCEALPHA_MASK              0x20000000
#define _GLCDL2MODE_FORCEALPHA_LENGTH            0x00000001

#define _GLCDL2MODE_DISABIFIL_POSITION           0x0000001E
#define _GLCDL2MODE_DISABIFIL_MASK               0x40000000
#define _GLCDL2MODE_DISABIFIL_LENGTH             0x00000001

#define _GLCDL2MODE_LAYEREN_POSITION             0x0000001F
#define _GLCDL2MODE_LAYEREN_MASK                 0x80000000
#define _GLCDL2MODE_LAYEREN_LENGTH               0x00000001

#define _GLCDL2START_STARTY_POSITION             0x00000000
#define _GLCDL2START_STARTY_MASK                 0x000007FF
#define _GLCDL2START_STARTY_LENGTH               0x0000000B

#define _GLCDL2START_STARTX_POSITION             0x00000010
#define _GLCDL2START_STARTX_MASK                 0x07FF0000
#define _GLCDL2START_STARTX_LENGTH               0x0000000B

#define _GLCDL2SIZE_SIZEY_POSITION               0x00000000
#define _GLCDL2SIZE_SIZEY_MASK                   0x000007FF
#define _GLCDL2SIZE_SIZEY_LENGTH                 0x0000000B

#define _GLCDL2SIZE_SIZEX_POSITION               0x00000010
#define _GLCDL2SIZE_SIZEX_MASK                   0x07FF0000
#define _GLCDL2SIZE_SIZEX_LENGTH                 0x0000000B

#define _GLCDL2BADDR_BASEADDR_POSITION           0x00000000
#define _GLCDL2BADDR_BASEADDR_MASK               0xFFFFFFFF
#define _GLCDL2BADDR_BASEADDR_LENGTH             0x00000020

#define _GLCDL2STRIDE_STRIDE_POSITION            0x00000000
#define _GLCDL2STRIDE_STRIDE_MASK                0x0000FFFF
#define _GLCDL2STRIDE_STRIDE_LENGTH              0x00000010

#define _GLCDL2RES_RESY_POSITION                 0x00000000
#define _GLCDL2RES_RESY_MASK                     0x000007FF
#define _GLCDL2RES_RESY_LENGTH                   0x0000000B

#define _GLCDL2RES_RESX_POSITION                 0x00000010
#define _GLCDL2RES_RESX_MASK                     0x07FF0000
#define _GLCDL2RES_RESX_LENGTH                   0x0000000B

#define _GLCDINT_VSYNCINT_POSITION               0x00000000
#define _GLCDINT_VSYNCINT_MASK                   0x00000001
#define _GLCDINT_VSYNCINT_LENGTH                 0x00000001

#define _GLCDINT_HSYNCINT_POSITION               0x00000001
#define _GLCDINT_HSYNCINT_MASK                   0x00000002
#define _GLCDINT_HSYNCINT_LENGTH                 0x00000001

#define _GLCDINT_IRQCON_POSITION                 0x0000001F
#define _GLCDINT_IRQCON_MASK                     0x80000000
#define _GLCDINT_IRQCON_LENGTH                   0x00000001

#define _GLCDSTAT_ACTIVE_POSITION                0x00000000
#define _GLCDSTAT_ACTIVE_MASK                    0x00000001
#define _GLCDSTAT_ACTIVE_LENGTH                  0x00000001

#define _GLCDSTAT_DE_POSITION                    0x00000001
#define _GLCDSTAT_DE_MASK                        0x00000002
#define _GLCDSTAT_DE_LENGTH                      0x00000001

